In [1]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame(np.random.randint(0,100,(5,2)),columns=['A','B'])
df2 = pd.DataFrame(np.random.random((5,2)),columns=['A','B'])
df3 = pd.DataFrame(np.random.random((5,2)),columns=['A','B'])
df1

    A   B
0  53  75
1  80  89
2  57  35
3  96  63
4  25  92

In [2]:
pd.concat([df1,df2])

           A          B
0  53.000000  75.000000
1  80.000000  89.000000
2  57.000000  35.000000
3  96.000000  63.000000
4  25.000000  92.000000
0   0.805367   0.605824
1   0.652572   0.585885
2   0.393918   0.226921
3   0.394991   0.185893
4   0.489238   0.938091

In [3]:
pd.concat([df1,df2],ignore_index=True)

           A          B
0  53.000000  75.000000
1  80.000000  89.000000
2  57.000000  35.000000
3  96.000000  63.000000
4  25.000000  92.000000
5   0.805367   0.605824
6   0.652572   0.585885
7   0.393918   0.226921
8   0.394991   0.185893
9   0.489238   0.938091

In [4]:
pd.concat([df1,df2],axis=1)

    A   B         A         B
0  53  75  0.805367  0.605824
1  80  89  0.652572  0.585885
2  57  35  0.393918  0.226921
3  96  63  0.394991  0.185893
4  25  92  0.489238  0.938091

In [5]:
d = {"Col1" : ['P','P','Q'],"Col2" : ['x','y','z'],"Col3" : ['A','B','C']}
df = pd.DataFrame(d)
df

  Col1 Col2 Col3
0    P    x    A
1    P    y    B
2    Q    z    C

In [6]:
pd.Series(df['Col1']).value_counts()

Col1
P    2
Q    1
Name: count, dtype: int64

In [7]:
d = {'Name':["Sun","Mon","Tue"],"Marks":[56,32,54],"Class":[1,2,3]}
df = pd.DataFrame(d,index=['a','b','c'])
df

  Name  Marks  Class
a  Sun     56      1
b  Mon     32      2
c  Tue     54      3

In [8]:
df.columns

Index(['Name', 'Marks', 'Class'], dtype='object')

In [9]:
list(df.columns)

['Name', 'Marks', 'Class']

In [10]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [11]:
list(df.index)

['a', 'b', 'c']

In [12]:
df.reindex([1,2,3])

  Name  Marks  Class
1  NaN    NaN    NaN
2  NaN    NaN    NaN
3  NaN    NaN    NaN

In [13]:
df.dtypes

Name     object
Marks     int64
Class     int64
dtype: object

In [14]:
df.reindex(columns=["Name","Class","Marks"])

  Name  Class  Marks
a  Sun      1     56
b  Mon      2     32
c  Tue      3     54

In [32]:

df.columns = ["ST_Name","ST_Class","ST_Marks"]
df

  ST_Name  ST_Class  ST_Marks
a     Sun        56         1
b     Mon        32         2
c     Tue        54         3

In [34]:
df.index=[2,3,4]
df

  ST_Name  ST_Class  ST_Marks
2     Sun        56         1
3     Mon        32         2
4     Tue        54         3